## Working with databses: sqlite3

In [2]:
import sqlite3

In [3]:
# create a new database or connect to existing database
conn = sqlite3.connect("mydata.db")

In [4]:
# creating a new table in the database
conn.execute("create table customers (cid text primary key, name text, age text, city text, email text);")

In [5]:
# inserting some data in customer table
insert_query = "insert into customers (cid,name,age,city,email) values(?,?,?,?,?)"
conn.execute(insert_query,('12345',"Jason","25","Singapore",'jason@bac.com'))

In [6]:
# inserting some data in customer table
conn.execute(insert_query,('12346',"John","55","Jakarta",'john@bac.com'))

In [8]:
# explore the existing data
cur = conn.cursor()
cur.execute("select * from customers;")
rows = cur.fetchall()
print(rows)

[('12345', 'Jason', '25', 'Singapore', 'jason@bac.com'), ('12346', 'John', '55', 'Jakarta', 'john@bac.com')]

In [9]:
for row in rows:print(row)

('12345', 'Jason', '25', 'Singapore', 'jason@bac.com')
('12346', 'John', '55', 'Jakarta', 'john@bac.com')

In [10]:
# explore the existing data
cur = conn.cursor()
cur.execute("select * from customers where cid=12345;")
rows = cur.fetchall()
print(rows)

[('12345', 'Jason', '25', 'Singapore', 'jason@bac.com')]

In [11]:
# inserting some data in customer table
conn.execute(insert_query,('12347',"Jennifer","26","Sydney",'jennifer@bac.com'))

In [12]:
# explore the existing data
cur = conn.cursor()
cur.execute("select * from customers;")
rows = cur.fetchall()
for row in rows:print(row)

('12345', 'Jason', '25', 'Singapore', 'jason@bac.com')
('12346', 'John', '55', 'Jakarta', 'john@bac.com')
('12347', 'Jennifer', '26', 'Sydney', 'jennifer@bac.com')

In [13]:
import pandas as pd

In [14]:
df = pd.read_sql_query("select * from customers;",con=conn)
df

     cid      name age       city             email
0  12345     Jason  25  Singapore     jason@bac.com
1  12346      John  55    Jakarta      john@bac.com
2  12347  Jennifer  26     Sydney  jennifer@bac.com

In [15]:
# adding a column to a table
conn.execute("alter table customers add country text;")

In [16]:
# explore the existing data
cur = conn.cursor()
cur.execute("select * from customers;")
rows = cur.fetchall()
for row in rows:print(row)

('12345', 'Jason', '25', 'Singapore', 'jason@bac.com', None)
('12346', 'John', '55', 'Jakarta', 'john@bac.com', None)
('12347', 'Jennifer', '26', 'Sydney', 'jennifer@bac.com', None)

In [17]:
# Creating a data frame
data = {'Name':['Anshu','Carlo','Ahmad','Jenny','Jasmine','Jennifer'],
'Gender':['Male','Male','Male','Female','Female','Female'],
'Age':[45,25,22,35,42,32],
'Current City':['DXB','KUL','HXB','DEL','MAA','AUH']}

df = pd.DataFrame(data)
df

       Name  Gender  Age Current City
0     Anshu    Male   45          DXB
1     Carlo    Male   25          KUL
2     Ahmad    Male   22          HXB
3     Jenny  Female   35          DEL
4   Jasmine  Female   42          MAA
5  Jennifer  Female   32          AUH

In [18]:
df.to_sql("users",con=conn)

c:\Users\admin\anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [21]:
# list of all tables
cur.execute("select * from sqlite_master where type='table';")
cur.fetchall()

[('table',
  'customers',
  'customers',
  2,
  'CREATE TABLE customers (cid text primary key, name text, age text, city text, email text, country text)'),
 ('table',
  'users',
  'users',
  4,
  'CREATE TABLE "users" (\n"index" INTEGER,\n  "Name" TEXT,\n  "Gender" TEXT,\n  "Age" INTEGER,\n  "Current City" TEXT\n)')]

In [22]:
# explore the existing data
cur = conn.cursor()
cur.execute("select * from users;")
rows = cur.fetchall()
for row in rows:print(row)

(0, 'Anshu', 'Male', 45, 'DXB')
(1, 'Carlo', 'Male', 25, 'KUL')
(2, 'Ahmad', 'Male', 22, 'HXB')
(3, 'Jenny', 'Female', 35, 'DEL')
(4, 'Jasmine', 'Female', 42, 'MAA')
(5, 'Jennifer', 'Female', 32, 'AUH')